In [8]:
import numpy as np
import pyodbc
import pandas as pd

In [9]:
conn = pyodbc.connect(
    '''
    DRIVER={ODBC Driver 17 for SQL Server};
    SERVER=DESKTOP-7CB1RAA;
    DATABASE=master;
    Trusted_Connection=yes;
    '''
    )

In [13]:
cursor = conn.cursor()
cursor.execute(
    '''
    SELECT TOP (10) [BusinessEntityID]
        ,[FirstName]
        ,[MiddleName]
        ,[LastName]
    FROM [CompanyX].[Person].[Person]
    ''')

result = cursor.fetchall()
print(result)

[(285, 'Syed', 'E', 'Abbas'), (293, 'Catherine', 'R.', 'Abel'), (295, 'Kim', None, 'Abercrombie'), (2170, 'Kim', None, 'Abercrombie'), (38, 'Kim', 'B', 'Abercrombie'), (211, 'Hazem', 'E', 'Abolrous'), (2357, 'Sam', None, 'Abolrous'), (297, 'Humberto', None, 'Acevedo'), (291, 'Gustavo', None, 'Achong'), (299, 'Pilar', None, 'Ackerman')]
(10, 4)

In [15]:
newRes = pd.DataFrame(np.asarray(result), columns=['BusinessEntityID','FirstName','MiddleName','LastName'])
display(newRes)

  BusinessEntityID  FirstName MiddleName     LastName
0              285       Syed          E        Abbas
1              293  Catherine         R.         Abel
2              295        Kim       None  Abercrombie
3             2170        Kim       None  Abercrombie
4               38        Kim          B  Abercrombie
5              211      Hazem          E     Abolrous
6             2357        Sam       None     Abolrous
7              297   Humberto       None      Acevedo
8              291    Gustavo       None       Achong
9              299      Pilar       None     Ackerman